---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentImport
source: html/7e19fe0c-4cf8-d9d2-9549-bdbf56e408b1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentImport Property

While making curved beam type "[Type Name]" CAD File elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentImport { get; }
```